{"config": {"input_layers": [["input_1", 0, 0]], "name": "m_2680", "layers": [{"config": {"batch_input_shape": [null, null, 355], "sparse": false, "name": "input_1", "dtype": "float32"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"bias_constraint": null, "units": 128, "batch_input_shape": [null, null, 355], "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "name": "dense_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"bias_constraint": null, "units": 128, "batch_input_shape": [null, null, 128], "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "name": "dense_2"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "dtype": "float32", "go_backwards": false, "kernel_constraint": null, "trainable": true, "return_sequences": true, "implementation": 1, "recurrent_regularizer": null, "dropout": 0.0, "batch_input_shape": [null, null, 128], "stateful": false, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "activation": "tanh", "units": 256, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "lstm_1", "return_state": false}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "lstm_1", "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.5, "seed": null, "name": "dropout_1", "noise_shape": null}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "dtype": "float32", "go_backwards": false, "kernel_constraint": null, "trainable": true, "return_sequences": true, "implementation": 1, "recurrent_regularizer": null, "dropout": 0.0, "batch_input_shape": [null, null, 256], "stateful": false, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "activation": "tanh", "units": 199, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "lstm_3", "return_state": false}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "lstm_3", "class_name": "LSTM"}, {"config": {"bias_constraint": null, "units": 199, "batch_input_shape": [null, 199], "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "name": "m_2680"}, "inbound_nodes": [[["lstm_3", 0, 0, {}]]], "name": "m_2680", "class_name": "Dense"}], "output_layers": [["m_2680", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}