{"config": {"layers": [{"config": {"batch_input_shape": [null, null, 355], "name": "input_1", "sparse": false, "dtype": "float32"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "trainable": true, "name": "dense_1", "kernel_constraint": null, "batch_input_shape": [null, null, 355], "dtype": "float32", "kernel_regularizer": null, "bias_regularizer": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "bias_constraint": null, "activity_regularizer": null}, "name": "dense_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "trainable": true, "name": "dense_2", "kernel_constraint": null, "batch_input_shape": [null, null, 128], "dtype": "float32", "kernel_regularizer": null, "bias_regularizer": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "bias_constraint": null, "activity_regularizer": null}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "name": "cu_dnnlstm_1", "kernel_constraint": null, "batch_input_shape": [null, null, 128], "recurrent_constraint": null, "go_backwards": false, "unit_forget_bias": true, "stateful": false, "kernel_regularizer": null, "bias_regularizer": null, "units": 256, "bias_constraint": null, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dtype": "float32", "return_state": false, "recurrent_regularizer": null, "activity_regularizer": null}, "name": "cu_dnnlstm_1", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "CuDNNLSTM"}, {"config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.5, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["cu_dnnlstm_1", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "name": "cu_dnnlstm_3", "kernel_constraint": null, "batch_input_shape": [null, null, 256], "recurrent_constraint": null, "go_backwards": false, "unit_forget_bias": true, "stateful": false, "kernel_regularizer": null, "bias_regularizer": null, "units": 199, "bias_constraint": null, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dtype": "float32", "return_state": false, "recurrent_regularizer": null, "activity_regularizer": null}, "name": "cu_dnnlstm_3", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "CuDNNLSTM"}, {"config": {"kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "trainable": true, "name": "m_2680", "kernel_constraint": null, "batch_input_shape": [null, 199], "dtype": "float32", "kernel_regularizer": null, "bias_regularizer": null, "units": 199, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "linear", "bias_constraint": null, "activity_regularizer": null}, "name": "m_2680", "inbound_nodes": [[["cu_dnnlstm_3", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["m_2680", 0, 0]], "name": "m_2680"}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Model"}