{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 512, "bias_regularizer": null, "batch_input_shape": [null, 360], "use_bias": true, "activation": "relu", "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0}, "class_name": "L1L2"}, "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "seed": null, "noise_shape": null, "rate": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 199, "bias_regularizer": null, "batch_input_shape": [null, 512], "use_bias": true, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}