{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 360], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "name": "dense_1", "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 1024, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Dense"}, {"config": {"rate": 0.3, "seed": null, "noise_shape": null, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "batch_input_shape": [null, 1024], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "name": "dense_2", "trainable": true, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 199, "kernel_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}