{"config": {"layers": [{"config": {"activation": "relu", "kernel_constraint": null, "units": 2024, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "trainable": true, "name": "dense_1", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "batch_input_shape": [null, 360]}, "class_name": "Dense"}, {"config": {"seed": null, "rate": 0.3, "trainable": true, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "relu", "kernel_constraint": null, "units": 2024, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "trainable": true, "name": "dense_2", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "batch_input_shape": [null, 2024]}, "class_name": "Dense"}, {"config": {"seed": null, "rate": 0.3, "trainable": true, "name": "dropout_2", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_constraint": null, "units": 199, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "trainable": true, "name": "dense_3", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "batch_input_shape": [null, 2024]}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}