{"backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 360], "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "units": 1024, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "name": "dense_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "trainable": true, "bias_regularizer": null, "activation": "selu", "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "seed": null, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1024], "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "units": 1024, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "name": "dense_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "trainable": true, "bias_regularizer": null, "activation": "selu", "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "seed": null, "noise_shape": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1024], "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "units": 1024, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "name": "dense_3", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "trainable": true, "bias_regularizer": null, "activation": "selu", "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "seed": null, "noise_shape": null, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1024], "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "units": 199, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "name": "dense_4", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "linear", "use_bias": true}}], "name": "sequential_1"}, "keras_version": "2.2.4"}