{"config": {"layers": [{"config": {"trainable": true, "name": "dense_1", "bias_regularizer": null, "batch_input_shape": [null, 360], "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "units": 2024, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0}, "class_name": "L1L2"}, "activation": "relu", "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "dense_2", "bias_regularizer": null, "batch_input_shape": [null, 2024], "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "units": 1012, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0}, "class_name": "L1L2"}, "activation": "relu", "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "dense_3", "bias_regularizer": null, "batch_input_shape": [null, 1012], "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "units": 199, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32"}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}