{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_constraint": null, "batch_input_shape": [null, 360], "use_bias": true, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "units": 2024, "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.3, "seed": null, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "batch_input_shape": [null, 2024], "use_bias": true, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "units": 199, "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_2"}}], "name": "sequential_1"}}