{"backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "name": "dense_1", "use_bias": true, "activation": "relu", "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 360], "bias_regularizer": null, "units": 4048, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}}}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "name": "dense_2", "use_bias": true, "activation": "relu", "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 4048], "bias_regularizer": null, "units": 2024, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}}}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "name": "dense_3", "use_bias": true, "activation": "linear", "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 2024], "bias_regularizer": null, "units": 199, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null}}], "name": "sequential_1"}, "keras_version": "2.2.4"}