{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 2048, "activation": "relu", "name": "dense_1", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "dtype": "float32", "kernel_constraint": null, "batch_input_shape": [null, null, 360], "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.3, "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 1024, "activation": "relu", "name": "dense_2", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "dtype": "float32", "kernel_constraint": null, "batch_input_shape": [null, null, 2048], "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.3, "seed": null}}, {"class_name": "GRU", "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "activation": "tanh", "return_state": false, "dropout": 0.0, "name": "gru_1", "recurrent_dropout": 0.0, "kernel_constraint": null, "unroll": false, "dtype": "float32", "go_backwards": false, "implementation": 1, "batch_input_shape": [null, null, 1024], "activity_regularizer": null, "reset_after": false, "use_bias": true, "stateful": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "return_sequences": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "noise_shape": null, "rate": 0.3, "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 199, "activation": "linear", "name": "dense_3", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "dtype": "float32", "kernel_constraint": null, "batch_input_shape": [null, 512], "activity_regularizer": null}}]}}