{"config": {"name": "sequential_1", "layers": [{"config": {"use_bias": true, "bias_regularizer": null, "units": 2048, "dtype": "float32", "activation": "relu", "name": "dense_1", "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, null, 360], "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.4, "seed": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_regularizer": null, "return_state": false, "return_sequences": true, "dtype": "float32", "stateful": false, "bias_constraint": null, "recurrent_regularizer": null, "kernel_constraint": null, "trainable": true, "implementation": 1, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_constraint": null, "batch_input_shape": [null, null, 2048], "activation": "tanh", "units": 1024, "name": "gru_1", "recurrent_dropout": 0.0, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "reset_after": false, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "GRU"}, {"config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "rate": 0.4, "seed": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_regularizer": null, "units": 199, "dtype": "float32", "activation": "linear", "name": "dense_2", "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 1024], "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}