{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "SimpleRNN", "config": {"return_sequences": true, "stateful": false, "go_backwards": false, "trainable": true, "kernel_constraint": null, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "dropout": 0.0, "name": "simple_rnn_1", "bias_constraint": null, "bias_regularizer": null, "units": 64, "activation": "tanh", "kernel_regularizer": null, "recurrent_dropout": 0.0, "batch_input_shape": [null, null, 360], "use_bias": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "recurrent_constraint": null, "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.3}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "units": 199, "batch_input_shape": [null, 64], "use_bias": true, "dtype": "float32", "trainable": true, "kernel_constraint": null, "name": "dense_1"}}], "name": "sequential_1"}}