{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "activation": "relu", "activity_regularizer": null, "batch_input_shape": [null, null, 360], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "name": "dense_1", "bias_constraint": null, "units": 2048, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dtype": "float32"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.4, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"use_bias": true, "dtype": "float32", "unit_forget_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "return_state": false, "recurrent_dropout": 0.0, "stateful": false, "trainable": true, "unroll": false, "activation": "tanh", "name": "lstm_1", "dropout": 0.0, "batch_input_shape": [null, null, 2048], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "implementation": 1, "bias_constraint": null, "units": 1024, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "kernel_constraint": null, "go_backwards": false, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.4, "noise_shape": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "activation": "linear", "activity_regularizer": null, "batch_input_shape": [null, 1024], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "name": "dense_2", "bias_constraint": null, "units": 199, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dtype": "float32"}}], "name": "sequential_1"}}