{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "name": "dense_1", "units": 2048, "batch_input_shape": [null, null, 360], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.5, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "dtype": "float32", "recurrent_regularizer": null, "batch_input_shape": [null, null, 2048], "go_backwards": false, "recurrent_constraint": null, "units": 1026, "bias_regularizer": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "dropout": 0.0, "recurrent_dropout": 0.0, "unroll": false, "kernel_constraint": null, "name": "lstm_1", "use_bias": true, "implementation": 1, "return_state": false, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "stateful": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.5, "noise_shape": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "name": "dense_2", "units": 199, "batch_input_shape": [null, 1026], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_1"}}