{"keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"batch_input_shape": [null, 351], "name": "dense_1", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "units": 133, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 133], "name": "dense_2", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "units": 133, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 133], "name": "dense_3", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "units": 5, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "trainable": true}}], "name": "sequential_1"}, "backend": "tensorflow"}