{"config": {"layers": [{"config": {"trainable": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "activation": "relu", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 351], "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0}, "class_name": "L1L2"}, "units": 32, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}}, "class_name": "Dense"}, {"config": {"rate": 0.3, "trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_2", "activation": "relu", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 32], "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0}, "class_name": "L1L2"}, "units": 16, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}}, "class_name": "Dense"}, {"config": {"rate": 0.3, "trainable": true, "seed": null, "name": "dropout_2", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_3", "activation": "linear", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 16], "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 5, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}