{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"batch_input_shape": [null, 351], "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "name": "dense_1", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "activation": "sigmoid", "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "trainable": true, "rate": 0.6, "noise_shape": null}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 1024], "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_2", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "activation": "linear", "use_bias": true}}]}}