{"config": {"layers": [{"config": {"batch_input_shape": [null, 351], "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "kernel_constraint": null, "use_bias": true, "units": 128, "bias_regularizer": null, "dtype": "float32", "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "activity_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "rate": 0.3, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"batch_input_shape": [null, 128], "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 5, "bias_regularizer": null, "dtype": "float32", "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}