{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "batch_input_shape": [null, 351], "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "use_bias": true, "name": "dense_1", "trainable": true, "kernel_constraint": null, "units": 64, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "dtype": "float32", "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.3, "name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "batch_input_shape": [null, 64], "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "use_bias": true, "name": "dense_2", "trainable": true, "kernel_constraint": null, "units": 32, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "dtype": "float32", "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.3, "name": "dropout_2", "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "batch_input_shape": [null, 32], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_3", "trainable": true, "kernel_constraint": null, "units": 5, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "dtype": "float32", "bias_constraint": null}}]}, "keras_version": "2.2.4", "backend": "tensorflow"}