{"backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"units": 64, "trainable": true, "use_bias": true, "batch_input_shape": [null, 351], "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "activation": "relu", "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.3, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Dense", "config": {"units": 5, "trainable": true, "use_bias": true, "batch_input_shape": [null, 64], "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "name": "dense_2", "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}}}]}, "keras_version": "2.2.4"}