{"backend": "tensorflow", "config": {"layers": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 351], "activity_regularizer": null, "units": 512, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "name": "dense_1", "dtype": "float32", "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "rate": 0.7, "trainable": true, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 512], "activity_regularizer": null, "units": 512, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "name": "dense_2", "dtype": "float32", "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "rate": 0.7, "trainable": true, "seed": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 512], "activity_regularizer": null, "units": 5, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "name": "dense_3", "dtype": "float32", "activation": "linear"}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential"}