{"config": {"name": "sequential_1", "layers": [{"config": {"name": "dense_1", "batch_input_shape": [null, 351], "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "dtype": "float32", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0}, "class_name": "L1L2"}, "activation": "sigmoid", "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "batch_input_shape": [null, 128], "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "dtype": "float32", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "units": 5, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "use_bias": true}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}