{"config": {"layers": [{"config": {"bias_constraint": null, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "name": "dense_1", "units": 128, "bias_regularizer": null, "batch_input_shape": [null, 351]}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.4}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "units": 5, "bias_regularizer": null, "batch_input_shape": [null, 128]}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4"}