{"config": {"layers": [{"config": {"kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "units": 133, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "batch_input_shape": [null, 351], "bias_constraint": null, "use_bias": true, "name": "dense_1", "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "units": 134, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "batch_input_shape": [null, 133], "bias_constraint": null, "use_bias": true, "name": "dense_2", "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "units": 5, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "batch_input_shape": [null, 134], "bias_constraint": null, "use_bias": true, "name": "dense_3", "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4"}