{"keras_version": "2.2.4", "config": {"layers": [{"config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "sigmoid", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 129, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "batch_input_shape": [null, 351], "name": "dense_1", "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 5, "kernel_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 129], "name": "dense_2", "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "dtype": "float32"}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow"}