{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "activation": "selu", "batch_input_shape": [null, 351], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "dtype": "float32", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_1", "rate": 0.2, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "kernel_regularizer": null, "activation": "linear", "batch_input_shape": [null, 512], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_2", "dtype": "float32", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}}}]}, "class_name": "Sequential", "keras_version": "2.2.4"}