{"config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"name": "dense_1", "dtype": "float32", "activity_regularizer": null, "activation": "sigmoid", "units": 63, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "batch_input_shape": [null, 351], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.3}}, {"class_name": "Dense", "config": {"name": "dense_2", "dtype": "float32", "activity_regularizer": null, "activation": "linear", "units": 5, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 63], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_regularizer": null, "trainable": true}}]}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}