{"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"batch_input_shape": [null, 351], "activation": "tanh", "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "kernel_constraint": null, "name": "dense_1", "units": 64, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.6}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 64], "activation": "linear", "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "kernel_constraint": null, "name": "dense_2", "units": 5, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_regularizer": null}}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.2.4"}