{"config": {"layers": [{"config": {"dtype": "float32", "units": 4048, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "batch_input_shape": [null, 351], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1", "rate": 0.65}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "units": 2024, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "batch_input_shape": [null, 4048], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_2", "rate": 0.65}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "units": 1012, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "batch_input_shape": [null, 2024], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_3", "rate": 0.65}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "units": 5, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "batch_input_shape": [null, 1012], "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_4"}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}