{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "name": "dense_1", "kernel_constraint": null, "units": 256, "activity_regularizer": null, "activation": "tanh", "dtype": "float32", "batch_input_shape": [null, 351], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "name": "dense_2", "kernel_constraint": null, "units": 5, "activity_regularizer": null, "activation": "linear", "dtype": "float32", "batch_input_shape": [null, 256], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}]}, "keras_version": "2.2.4"}