{"config": {"name": "sequential_1", "layers": [{"config": {"name": "dense_1", "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "activation": "selu", "units": 512, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "batch_input_shape": [null, 351]}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "seed": null, "trainable": true, "rate": 0.3, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "activation": "selu", "units": 512, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "batch_input_shape": [null, 512]}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "seed": null, "trainable": true, "rate": 0.3, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "activation": "selu", "units": 512, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "batch_input_shape": [null, 512]}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "seed": null, "trainable": true, "rate": 0.3, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense_4", "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "units": 5, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "batch_input_shape": [null, 512]}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}