{"config": {"layers": [{"config": {"kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0}, "class_name": "L1L2"}, "dtype": "float32", "use_bias": true, "activation": "sigmoid", "batch_input_shape": [null, 351], "name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "units": 132, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"seed": null, "noise_shape": null, "rate": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "use_bias": true, "activation": "linear", "batch_input_shape": [null, 132], "name": "dense_2", "activity_regularizer": null, "bias_constraint": null, "units": 5, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}