{"config": {"layers": [{"config": {"dtype": "float32", "name": "dense_1", "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "units": 512, "kernel_constraint": null, "use_bias": true, "batch_input_shape": [null, 351], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null, "rate": 0.6}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "name": "dense_2", "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "units": 5, "kernel_constraint": null, "use_bias": true, "batch_input_shape": [null, 512], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}