{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "selu", "dtype": "float32", "units": 1024, "name": "dense_1", "batch_input_shape": [null, 351], "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.1, "name": "dropout_1", "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "dtype": "float32", "units": 5, "name": "dense_2", "batch_input_shape": [null, 1024], "trainable": true}}]}, "class_name": "Sequential", "backend": "tensorflow"}