{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "units": 512, "batch_input_shape": [null, 351], "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true, "activation": "relu", "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "units": 256, "batch_input_shape": [null, 512], "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true, "activation": "relu", "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "units": 128, "batch_input_shape": [null, 256], "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true, "activation": "relu", "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "noise_shape": null, "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "units": 5, "batch_input_shape": [null, 128], "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true, "activation": "linear", "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}], "name": "sequential_1"}}