{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"config": {"kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "dtype": "float32", "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "batch_input_shape": [null, 351], "units": 8096, "use_bias": true, "activation": "sigmoid", "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.7}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "dtype": "float32", "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "batch_input_shape": [null, 8096], "units": 5, "use_bias": true, "activation": "linear", "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}