{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "activation": "relu", "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "batch_input_shape": [null, 351], "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "dtype": "float32", "trainable": true, "use_bias": true, "units": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "rate": 0.1, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "activation": "linear", "bias_regularizer": null, "name": "dense_2", "kernel_constraint": null, "batch_input_shape": [null, 32], "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "use_bias": true, "units": 5, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}}