{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "batch_input_shape": [null, 351], "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "dtype": "float32", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "trainable": true, "units": 131, "activity_regularizer": null, "activation": "sigmoid"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_constraint": null, "batch_input_shape": [null, 131], "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "dtype": "float32", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "units": 5, "activity_regularizer": null, "activation": "linear"}}]}, "keras_version": "2.2.4", "backend": "tensorflow"}