{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "batch_input_shape": [null, 351], "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "activation": "selu", "name": "dense_1", "units": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "bias_regularizer": null, "dtype": "float32"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "batch_input_shape": [null, 256], "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "activation": "selu", "name": "dense_2", "units": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "bias_regularizer": null, "dtype": "float32"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "batch_input_shape": [null, 256], "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "activation": "selu", "name": "dense_3", "units": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "bias_regularizer": null, "dtype": "float32"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "batch_input_shape": [null, 128], "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "activation": "selu", "name": "dense_4", "units": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "bias_regularizer": null, "dtype": "float32"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "batch_input_shape": [null, 128], "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "activation": "linear", "name": "dense_5", "units": 5, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32"}}]}, "keras_version": "2.2.4"}