{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"class_name": "Dense", "config": {"activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "dtype": "float32", "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "units": 32, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "batch_input_shape": [null, 351], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "name": "dropout_1", "trainable": true, "rate": 0.3}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "dtype": "float32", "name": "dense_2", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "units": 32, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "batch_input_shape": [null, 32], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "name": "dropout_2", "trainable": true, "rate": 0.3}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "dtype": "float32", "name": "dense_3", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "units": 32, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "batch_input_shape": [null, 32], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "name": "dropout_3", "trainable": true, "rate": 0.3}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "dtype": "float32", "name": "dense_4", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "units": 5, "bias_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 32], "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_1"}}