{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "dtype": "float32", "use_bias": true, "batch_input_shape": [null, 351], "bias_regularizer": null, "name": "dense_1", "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1024, "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "seed": null, "rate": 0.4, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "dtype": "float32", "use_bias": true, "batch_input_shape": [null, 1024], "bias_regularizer": null, "name": "dense_2", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 5, "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential"}