{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"kernel_constraint": null, "batch_input_shape": [null, 351], "activity_regularizer": null, "dtype": "float32", "name": "dense_1", "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 4048, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.6, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "batch_input_shape": [null, 4048], "activity_regularizer": null, "dtype": "float32", "name": "dense_2", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 5, "use_bias": true}}]}}