{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"dtype": "float32", "name": "dense_1", "units": 8, "batch_input_shape": [null, 351], "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "sigmoid", "bias_constraint": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.0, "name": "dropout_1", "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"dtype": "float32", "name": "dense_2", "units": 5, "batch_input_shape": [null, 8], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "use_bias": true}}]}}