{"class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "dtype": "float32", "activity_regularizer": null, "name": "dense_1", "batch_input_shape": [null, 351], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "kernel_constraint": null, "units": 8096, "use_bias": true, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "name": "dense_2", "batch_input_shape": [null, 8096], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "kernel_constraint": null, "units": 5, "use_bias": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_1"}, "keras_version": "2.2.4"}