{"config": {"layers": [{"config": {"reset_after": false, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "name": "gru_1", "dropout": 0.0, "bias_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_regularizer": null, "implementation": 1, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "units": 512, "activity_regularizer": null, "return_state": false, "stateful": false, "recurrent_constraint": null, "batch_input_shape": [null, null, 351], "recurrent_activation": "hard_sigmoid", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "kernel_regularizer": null, "activation": "tanh"}, "class_name": "GRU"}, {"config": {"rate": 0.3, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "dtype": "float32", "name": "dense_1", "batch_input_shape": [null, 512], "units": 5, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}