{"config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"name": "dense_1", "bias_constraint": null, "trainable": true, "batch_input_shape": [null, null, 351], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dtype": "float32", "bias_regularizer": null, "use_bias": true, "activation": "sigmoid", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "units": 64}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "recurrent_activation": "hard_sigmoid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "unroll": false, "batch_input_shape": [null, null, 64], "recurrent_regularizer": null, "stateful": false, "bias_constraint": null, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "dropout": 0.0, "return_sequences": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "tanh", "unit_forget_bias": true, "activity_regularizer": null, "kernel_constraint": null, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "go_backwards": false, "units": 64, "recurrent_dropout": 0.0}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_constraint": null, "trainable": true, "batch_input_shape": [null, 64], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dtype": "float32", "bias_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "units": 5}}]}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}