{"config": {"name": "sequential_1", "layers": [{"config": {"activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "units": 4048, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "name": "dense_1", "batch_input_shape": [null, null, 351], "bias_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null, "rate": 0.6}, "class_name": "Dropout"}, {"config": {"name": "lstm_1", "activation": "tanh", "recurrent_dropout": 0.0, "bias_regularizer": null, "kernel_constraint": null, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "unit_forget_bias": true, "units": 512, "recurrent_regularizer": null, "return_sequences": true, "dtype": "float32", "return_state": false, "implementation": 1, "recurrent_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "stateful": false, "batch_input_shape": [null, null, 4048], "bias_constraint": null, "trainable": true, "dropout": 0.0, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "trainable": true, "name": "dropout_2", "seed": null, "rate": 0.6}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "units": 5, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "name": "dense_2", "batch_input_shape": [null, 512], "bias_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}