{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"activation": "tanh", "batch_input_shape": [null, null, 351], "recurrent_dropout": 0.0, "go_backwards": false, "bias_constraint": null, "use_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "return_state": false, "dtype": "float32", "recurrent_regularizer": null, "trainable": true, "name": "lstm_1", "implementation": 1, "unit_forget_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 16, "unroll": false, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dropout": 0.0, "return_sequences": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"activation": "linear", "batch_input_shape": [null, 16], "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "units": 5, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}]}, "class_name": "Sequential"}