{"config": {"layers": [{"config": {"bias_constraint": null, "dropout": 0.0, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "name": "lstm_1", "kernel_constraint": null, "activity_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_dropout": 0.0, "use_bias": true, "unroll": false, "batch_input_shape": [null, null, 351], "dtype": "float32", "return_sequences": true, "bias_regularizer": null, "go_backwards": false, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "recurrent_activation": "hard_sigmoid", "units": 66, "activation": "tanh", "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"seed": null, "trainable": true, "rate": 0.1, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "batch_input_shape": [null, 66], "name": "dense_1", "bias_regularizer": null, "dtype": "float32", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 5, "activation": "linear"}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}