{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "tanh", "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "dtype": "float32", "trainable": true, "batch_input_shape": [null, null, 351], "name": "lstm_1", "units": 64, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "use_bias": true, "kernel_regularizer": null, "recurrent_constraint": null, "return_sequences": true, "activity_regularizer": null, "return_state": false, "implementation": 1, "stateful": false, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "unit_forget_bias": true, "unroll": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "seed": null, "trainable": true, "rate": 0.3, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "trainable": true, "batch_input_shape": [null, 64], "name": "dense_1", "bias_regularizer": null, "units": 5, "kernel_regularizer": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential"}