{"backend": "tensorflow", "config": {"layers": [{"config": {"activity_regularizer": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, null, 351], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "dtype": "float32", "name": "dense_1", "use_bias": true}, "class_name": "Dense"}, {"config": {"noise_shape": null, "rate": 0.3, "name": "dropout_1", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "unroll": false, "units": 32, "stateful": false, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, null, 64], "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "implementation": 1, "use_bias": true, "return_sequences": true, "name": "lstm_1", "dtype": "float32", "recurrent_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "rate": 0.3, "name": "dropout_2", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "units": 5, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 32], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "dtype": "float32", "name": "dense_2", "use_bias": true}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4"}