{"backend": "tensorflow", "config": {"layers": [{"config": {"recurrent_regularizer": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "batch_input_shape": [null, null, 351], "stateful": false, "unroll": false, "name": "lstm_1", "return_state": false, "units": 124, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "go_backwards": false, "return_sequences": true, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "bias_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "implementation": 1, "recurrent_dropout": 0.0, "dtype": "float32", "dropout": 0.0, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"seed": null, "rate": 0.4, "trainable": true, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "trainable": true, "name": "dense_1", "activity_regularizer": null, "batch_input_shape": [null, 124], "activation": "linear", "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dtype": "float32", "units": 5, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4"}