{"config": {"layers": [{"config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "activation": "tanh", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "batch_input_shape": [null, null, 351], "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "return_state": false, "kernel_constraint": null, "trainable": true, "unroll": false, "recurrent_dropout": 0.0, "use_bias": true, "stateful": false, "name": "lstm_1", "return_sequences": true, "bias_constraint": null, "units": 32, "kernel_regularizer": null, "go_backwards": false, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1", "rate": 0.3}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "linear", "use_bias": true, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "dtype": "float32", "batch_input_shape": [null, 32], "units": 5, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}