{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"batch_input_shape": [null, null, 351], "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true, "units": 256, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.55, "name": "dropout_1", "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, null, 256], "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true, "units": 128, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.55, "name": "dropout_2", "trainable": true, "noise_shape": null}}, {"class_name": "GRU", "config": {"batch_input_shape": [null, null, 128], "recurrent_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "use_bias": true, "implementation": 1, "stateful": false, "bias_constraint": null, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "return_state": false, "trainable": true, "units": 64, "return_sequences": true, "name": "gru_1", "go_backwards": false, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "reset_after": false, "unroll": false, "recurrent_constraint": null, "dtype": "float32", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.55, "name": "dropout_3", "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 64], "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true, "units": 5, "name": "dense_3"}}], "name": "sequential_1"}}